"espk" = "Port speaker Apple";
"ispk" = "Internal";
"emic" = "Port mikrofon";
"imic" = "Internal";
"hdpn" = "Port headphone";
"lini" = "Port line-in audio";
"lino" = "Port saluran keluar audio";
"spdi" = "Port digital masuk optik";
"spdo" = "Port digital keluar optik";
"pci " = "Kartu PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Perangkat jaringan";
"blue" = "Bluetooth";
"bluh" = "Headphone Bluetooth";
"blus" = "Headset Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
